# 4.7 Долгожданная адресная арифметика
* **Подвиг 1.** Пусть в программе объявлены следующие переменные и указатели:
```C
int a = 5, b = 7;
double d = 2.0;
int* ptr_a = &a, *ptr_b = &b;
```
* Выберите все верные (рабочие) варианты использования операций адресной арифметики для указателей ptr_a и ptr_b.
  * (+)ptr_b++;
  * (-)ptr_b += ptr_a;
  * (-)ptr_a -= d;
  * (-)ptr_a /= b;
  * (+)ptr_a += b * 5;
  * (+)ptr_a += 3;
  * (-)ptr_a *= a;
  * (-)ptr_b + ptr_a;
  * (-)ptr_b -= ptr_a;
  * (+)--ptr_a;

* **Подвиг 2.** Пусть имеется следующий фрагмент программы:
```C
short* p = (short *)10;  // тип short 16 бит
p++;
```
* Чему будет равен адрес указателя p при выполнении этих двух строчек?
  * Ответ: 12

* **Подвиг 3.** Пусть имеется следующий фрагмент программы:
```C
double digs[100];
double* p1 = &digs[2], *p2 = &digs[7];
int count = p2 - p1;
```
* Чему будет равно значение переменной count при выполнении этих двух строчек?
  * Ответ: 5

* **Подвиг 10 (на повторение).** Установите соответствия между суффиксами спецификаторов функции printf() и их описаниями.
  * l (эл малая) = суффикс для типов long или unsigned long
  * ll (две эл малые) = суффикс для типов long long или unsigned long long
  * L = суффикс для типа long double
  * LL = такой суффикс не существует




